[
    {
        "headline": "Updated Guidelines for Non-Pharmacological Dementia Interventions",
        "snippet": "New clinical practice guidelines recommend multimodal cognitive stimulation and personalized activity programs as first-line non-drug interventions for dementia.",
        "url": "https://www.dementiapracticeguidelines.org/2023-update"
    },
    {
        "headline": "Telehealth Dementia Care Model Reduces Hospitalizations by 30%",
        "snippet": "Integrated telehealth program combining remote monitoring and virtual consultations significantly reduces emergency department visits for dementia patients.",
        "url": "https://www.healthaffairs.org/doi/10.1377/hlthaff.2023.00845"
    },
    {
        "headline": "Caregiver Support Program Shows Improved Patient Outcomes",
        "snippet": "Structured caregiver education and respite program leads to reduced behavioral symptoms and delayed nursing home placement for dementia patients.",
        "url": "https://www.geriatriccarejournal.org/article/S0016-5085(23)04567-8"
    },
    {
        "headline": "Music Therapy Protocol Standardized for Dementia Agitation",
        "snippet": "Evidence-based music intervention protocol demonstrates consistent reduction in agitation and anxiety across dementia stages in multicenter trial.",
        "url": "https://www.musictherapy.org/dementia-protocol-validation"
    },
    {
        "headline": "Advanced Directive Planning Tool for Dementia Patients",
        "snippet": "Digital platform facilitates early advance care planning conversations, resulting in higher completion rates of legally valid dementia-specific directives.",
        "url": "https://www.palliativecare.org/dementia-advance-directive-tool"
    },
    {
        "headline": "Multidisciplinary Team Approach Cuts Antipsychotic Use in Dementia",
        "snippet": "Collaborative care model reduces inappropriate antipsychotic prescribing by 60% through behavioral intervention specialists and pharmacist consultation.",
        "url": "https://www.jamda.com/article/S1525-8610(23)00876-3"
    },
    {
        "headline": "Dementia-Friendly Hospital Design Reduces Patient Distress",
        "snippet": "Environmental modifications including clear signage, reduced noise, and dedicated quiet spaces decrease confusion and falls in hospitalized dementia patients.",
        "url": "https://www.healthdesign.org/dementia-friendly-hospital-outcomes"
    },
    {
        "headline": "Nutritional Intervention Slows Functional Decline in Dementia",
        "snippet": "Medical nutrition therapy with specific micronutrient supplementation shows significant preservation of activities of daily living in moderate dementia.",
        "url": "https://www.clinicalnutritionjournal.com/article/S0261-5614(23)00234-9"
    },
    {
        "headline": "Comprehensive Driving Assessment Protocol for Dementia Patients",
        "snippet": "Standardized driving evaluation combining cognitive testing and road assessment safely identifies driving competence while preserving patient autonomy.",
        "url": "https://www.neurology.org/driving-assessment-dementia-protocol"
    },
    {
        "headline": "End-of-Life Care Pathway Improves Comfort in Advanced Dementia",
        "snippet": "Structured palliative care pathway ensures appropriate symptom management and reduces aggressive interventions in final stages of dementia.",
        "url": "https://www.jpsmjournal.com/article/S0885-3924(23)00678-2"
    }
]
